[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/QvwrGJB7/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms",
    "description": "WhatsApp Messenger is a versatile messaging application that provides fast, reliable, and secure communication for users worldwide. It enables users to send text messages, voice messages, photos, videos, documents, and other multimedia content instantly across devices. WhatsApp supports one-on-one and group chats, allowing families, friends, colleagues, and communities to communicate seamlessly. The platform emphasizes security with end-to-end encryption, ensuring that only intended recipients can access the content of messages and calls. Users can also make high-quality voice and video calls anywhere in the world, offering an affordable and convenient alternative to traditional communication methods. WhatsApp provides status updates, where users can share photos, videos, and text with contacts for 24 hours, enhancing social interaction. Its integration with phone contacts simplifies communication and helps users connect with anyone on the platform. The app supports cross-device usage, allowing users to stay connected via smartphones, tablets, and desktops. WhatsApp’s intuitive interface and reliable notifications enhance usability, ensuring messages are never missed. Additionally, it offers features like voice notes, location sharing, and file transfer, improving productivity and engagement. Businesses and organizations can leverage WhatsApp Business to communicate with clients, provide customer support, and share updates efficiently. Regular updates ensure enhanced functionality, security, and user experience. With billions of users worldwide, WhatsApp Messenger has become a cornerstone of modern digital communication, combining speed, reliability, and privacy. It empowers individuals and groups to stay connected, share moments, collaborate effectively, and maintain meaningful relationships, redefining how people communicate across the globe in personal and professional contexts.",
    "size": 35,
    "reviews": 45,
    "ratingAvg": 4.4,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2400000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/BH7VRzKZ/fb-images.png",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "description": "Facebook is a global social networking platform that enables users to connect, share, and communicate with friends, family, and communities worldwide. Users can create profiles, post text updates, share photos and videos, and interact through likes, comments, and shares. The platform provides groups, pages, and events, allowing individuals and organizations to create communities, share interests, organize events, and engage with audiences effectively. News Feed delivers personalized content based on user preferences, interactions, and trending topics, ensuring that users stay informed and engaged with relevant posts. Facebook supports messaging, video calls, and live streaming, enabling real-time communication and content sharing. Businesses and brands can leverage the platform for marketing, advertising, and audience engagement, utilizing tools like Ads Manager, insights, and analytics to reach targeted demographics. Privacy and security settings allow users to control who sees their content, friend requests, and interactions, providing a safe and customizable experience. Mobile and desktop accessibility ensures seamless connectivity from anywhere. Facebook also integrates features like Marketplace for buying and selling products, Gaming for interactive experiences, and Watch for video content, diversifying user engagement. The platform continuously evolves with new tools, features, and security enhancements to maintain relevance, user satisfaction, and protection. With billions of users worldwide, Facebook has become a cornerstone of online social interaction, enabling users to build relationships, share experiences, discover trends, and participate in a dynamic digital community, bridging geographic and social distances through meaningful communication, content sharing, and community engagement.",
    "size": 60,
    "reviews": 50,
    "ratingAvg": 4.1,
    "downloads": 70,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1600000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/9mZj27R1/insta-images.png",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "description": "Instagram is a visual-centric social media platform that allows users to share photos, videos, stories, and reels, providing a rich and engaging environment for creativity, self-expression, and social interaction. Users can customize their profiles, follow friends, influencers, celebrities, and brands, and discover content aligned with their interests. The platform offers features like Stories for ephemeral content, IGTV for long-form videos, Reels for short creative clips, and Direct Messaging for private conversations. Users can interact through likes, comments, shares, and saving content, fostering engagement and community building. Instagram’s Explore feature suggests content tailored to user preferences, promoting discovery of new trends, creators, and products. For businesses and creators, Instagram provides tools for marketing, analytics, and audience engagement, enabling brand growth and monetization opportunities. Shopping features allow users to browse, compare, and purchase products directly through the app, integrating e-commerce seamlessly. Privacy and security settings give users control over who can view content, send messages, and interact, enhancing safety. Mobile accessibility ensures instant connectivity and participation from anywhere. Instagram also encourages creative expression with filters, stickers, AR effects, and editing tools, making content visually appealing. Hashtags and tagging increase content discoverability, fostering community interaction and participation. With its emphasis on visual storytelling, social connection, and engagement, Instagram has become a leading platform for personal expression, brand promotion, creative exploration, and digital social interaction. It empowers users to showcase talents, connect with communities, and stay informed about trends and culture, creating a dynamic, interactive, and visually immersive online experience.",
    "size": 45,
    "reviews": 29,
    "ratingAvg": 4.3,
    "downloads": 30,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1350000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/s99SdDCt/tiktok.jpg",
    "title": "TikTok",
    "companyName": "ByteDance",
    "description": "TikTok is a leading short-form video platform that allows users to create, share, and discover entertaining, educational, and creative content worldwide. Users can record videos, apply filters, effects, music overlays, and text to make engaging content, fostering creativity and self-expression. The app’s algorithm curates personalized feeds, suggesting videos based on user behavior, interests, and interactions, ensuring a dynamic and highly engaging experience. TikTok provides features like duets, stitches, and collaborative content, enabling interaction with other creators and expanding community engagement. Users can follow favorite creators, engage with content through likes, comments, and shares, and participate in trending challenges and hashtags. TikTok supports live streaming, offering direct engagement opportunities with audiences. Businesses, creators, and brands can leverage TikTok for marketing, promotions, influencer collaborations, and targeted advertisements to reach specific demographics effectively. Privacy and security controls enable users to manage who can view, comment, or interact with their content, ensuring a safe environment. TikTok’s mobile accessibility and intuitive interface make it easy to create, upload, and consume content anywhere. Its combination of creativity, discoverability, and engagement has made it a cultural phenomenon, influencing trends, music, and digital marketing globally. With billions of active users, TikTok serves as a platform for entertainment, education, creativity, and connection, allowing individuals and businesses to share ideas, express themselves, and engage with global communities through interactive and short-form visual content, redefining modern social media engagement and digital culture.",
    "size": 60,
    "reviews": 35,
    "ratingAvg": 4.5,
    "downloads": 40,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 280000 },
      { "name": "4 star", "count": 950000 },
      { "name": "5 star", "count": 1900000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/XZdjb4Mq/youtube-logo.jpg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is a global video-sharing platform that allows users to watch, upload, share, and comment on videos across a vast range of categories and interests. It provides entertainment, education, news, tutorials, music, gaming, and lifestyle content for billions of users worldwide. Creators can produce and publish videos, build channels, interact with audiences through comments and community posts, and monetize content through advertising, memberships, and sponsorships. YouTube offers personalized recommendations and playlists, powered by advanced algorithms that suggest content based on user preferences and viewing history, enhancing engagement and discovery. The platform supports live streaming, premieres, and community features, allowing real-time interaction and engagement. YouTube’s mobile and web accessibility ensures seamless consumption anytime, anywhere. Users can like, share, save, and comment on videos, creating social interaction and discussion around content. Privacy settings allow creators and viewers to control visibility, comments, and data access, enhancing security. YouTube also provides premium features for ad-free viewing, offline downloads, and access to YouTube Music, improving user experience. The platform is a hub for learning, entertainment, marketing, and cultural exchange, empowering users to access diverse content, discover trends, and engage with communities globally. YouTube has revolutionized digital video consumption, offering creators and viewers an interactive, accessible, and engaging space for content creation, discovery, and connection across multiple topics, genres, and formats. It continues to shape digital media, entertainment, and education worldwide, becoming an essential platform for personal and professional engagement.",
    "size": 80,
    "reviews": 60,
    "ratingAvg": 4.6,
    "downloads": 80,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 2800000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/yBY5nfHZ/x-logo.png",
    "title": "X-Twitter",
    "companyName": "X Corp",
    "description": "X-Twitter is a dynamic social media platform focused on short, concise communication through text posts, multimedia, and links. Users can post updates, share news, and participate in real-time conversations with followers, creating a fast-paced information ecosystem. The platform encourages engagement through likes, retweets, replies, and quotes, allowing users to amplify content and participate in discussions worldwide. Trending topics highlight the most relevant conversations, helping users stay informed about global events, popular culture, and emerging trends. X-Twitter supports multimedia integration, enabling photos, videos, GIFs, polls, and external links, which enhance interaction and expressiveness. Users can follow accounts of friends, celebrities, organizations, and news sources to curate a personalized feed of content that aligns with their interests. The platform also features lists and bookmarks for content organization, making it easy to track favorite accounts and topics. Businesses and creators can leverage X-Twitter to share updates, market products, and engage with audiences directly, while advertisers can use promoted posts to reach specific demographics effectively. Advanced privacy settings let users control who can view, comment, or interact with their posts, ensuring a secure social experience. Mobile and web accessibility ensures seamless engagement from anywhere, at any time. X-Twitter continuously introduces features to improve usability, content discovery, and platform safety. With its emphasis on brevity, immediacy, and connectivity, X-Twitter serves as a vital space for global conversation, social interaction, and information dissemination. It empowers individuals to express opinions, engage with communities, and stay updated in a fast-moving digital landscape, making it a central hub for personal and professional communication online.",
    "size": 50,
    "reviews": 20,
    "ratingAvg": 4.0,
    "downloads": 25,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 650000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/21KHRstH/1-snapchat.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging platform that enables users to send photos, videos, and messages that disappear after being viewed. The app emphasizes creativity, spontaneity, and privacy, providing a space where moments can be shared authentically without leaving a permanent digital footprint. Snapchat supports interactive features such as filters, lenses, stickers, and augmented reality effects, allowing users to enhance their content in fun and innovative ways. Stories enable users to compile images and videos for sharing with friends over a 24-hour period, while private chats allow secure, one-on-one communication. The platform also offers Discover channels, where curated content from creators, publishers, and brands is accessible, providing entertainment, news, and educational material. Snapchat’s Snap Map feature allows users to explore the location of friends and trending events in real time, fostering social interaction and community engagement. Multimedia messaging is complemented by video and voice calling, enabling seamless communication with contacts. Snapchat provides tools for group chats and collaborative content creation, allowing multiple users to contribute to shared stories and experiences. Privacy is central to the app, with controls over who can view content, send messages, or access location data. For businesses and influencers, Snapchat offers marketing opportunities through Snap Ads, sponsored lenses, and content promotion, engaging a younger demographic effectively. The platform is accessible on mobile devices, ensuring communication and content sharing anytime, anywhere. With its emphasis on ephemeral messaging, creative expression, and social engagement, Snapchat has become a popular platform for staying connected, exploring trends, and sharing moments in a secure, enjoyable, and interactive way. It empowers users to communicate, discover, and express themselves freely in a fast-paced digital environment.",
    "size": 45,
    "reviews": 12,
    "ratingAvg": 4.2,
    "downloads": 18,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 550000 },
      { "name": "5 star", "count": 700000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/YBHdnznx/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a cloud-based messaging platform designed for fast, secure, and versatile communication. It allows users to send text messages, images, videos, documents, and other files instantly across devices, while providing advanced privacy and security features, including end-to-end encryption in secret chats. Telegram supports both one-on-one conversations and group chats with thousands of participants, making it suitable for personal, community, and organizational communication. Users can create channels for broadcasting messages to unlimited audiences, share media, and provide updates efficiently. The platform also offers bots, which automate tasks, provide information, or facilitate engagement within groups and channels. Telegram’s cloud storage ensures that all messages, media, and files are accessible across devices without loss of data, enhancing convenience and continuity. Users can customize their experience with themes, stickers, and animated emojis, creating a personalized and engaging messaging environment. Voice calls, video calls, and video messages are integrated seamlessly, supporting real-time communication. Telegram prioritizes security, with two-factor authentication, self-destructing messages, and robust privacy controls that allow users to manage who can view their data and interact with them. The platform’s fast performance and lightweight design make it efficient even on low-bandwidth networks. For organizations, creators, and communities, Telegram offers tools to manage audiences, share updates, and engage in discussions, fostering collaboration and information dissemination. Mobile and desktop compatibility ensures users remain connected anytime, anywhere. With its combination of speed, security, flexibility, and multimedia support, Telegram has become a preferred platform for individuals and groups seeking reliable, private, and efficient communication. It empowers users to connect, share, and collaborate meaningfully in personal, professional, and community settings, offering a comprehensive solution for modern digital interaction.",
    "size": 30,
    "reviews": 15,
    "ratingAvg": 4.7,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1070000 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co.com/hJyqktG8/download.png",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "description": "LinkedIn is a professional networking platform that enables individuals and organizations to connect, engage, and grow their professional presence. Users can create detailed profiles showcasing their education, experience, skills, and accomplishments, allowing them to establish credibility and visibility within their industry. The platform facilitates networking by enabling users to connect with colleagues, industry professionals, potential employers, and business partners. LinkedIn provides tools for posting content, sharing insights, and participating in discussions, fostering professional knowledge exchange and community engagement. Job seekers can search for opportunities, apply directly, and receive notifications about relevant positions, while companies can post openings, attract talent, and enhance employer branding. Learning resources and LinkedIn Learning courses support skill development and career advancement, covering a wide range of industries and disciplines. Groups and communities allow professionals to share ideas, ask questions, and collaborate on projects or initiatives. LinkedIn’s algorithm personalizes the feed to surface relevant updates, articles, and opportunities, keeping users informed about industry trends and professional growth. Messaging, endorsements, and recommendations enable meaningful interaction and reputation building. The platform’s analytics and premium tools provide insights for personal and business growth. Privacy and security features protect user information, giving control over visibility and interactions. Accessible via mobile and web interfaces, LinkedIn ensures connectivity and engagement anytime. With its focus on professional development, networking, and knowledge sharing, LinkedIn empowers users to build meaningful connections, advance careers, and stay informed, making it an essential platform for professionals and organizations seeking growth, influence, and opportunities in the global workforce.",
    "size": 55,
    "reviews": 12,
    "ratingAvg": 4.3,
    "downloads": 80,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 630000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/spSfJ3pQ/pinterest2.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "description": "Pinterest is a visual discovery and bookmarking platform that allows users to explore, collect, and organize ideas and inspiration for a wide range of interests. Users can search for and save pins, which are images, videos, and links, to personal boards, creating curated collections for hobbies, projects, events, and lifestyle goals. Pinterest encourages creativity and planning by providing ideas for home decor, fashion, recipes, travel, education, and more. The platform’s smart recommendations suggest content based on user preferences and saved pins, enabling discovery of new trends, products, and inspiration. Users can follow other accounts, boards, or topics to see fresh content in their feed, while engaging by liking, commenting, and sharing pins. Pinterest supports collaboration, allowing group boards where multiple users can contribute ideas for events, projects, or shared interests. The platform also integrates e-commerce opportunities, enabling users to explore products, access price comparisons, and make purchases through affiliate links or direct sellers. Privacy and customization features allow users to control board visibility and personal information. Pinterest’s mobile and web interfaces ensure seamless access anytime, anywhere, facilitating inspiration and planning on the go. Businesses and creators can leverage Pinterest for marketing, audience engagement, and brand promotion, utilizing visual content to drive awareness and conversions. With a focus on creativity, organization, and discovery, Pinterest has become a valuable tool for individuals and professionals seeking inspiration, visual planning, and knowledge across diverse topics. By combining visual content, community interaction, and practical utility, Pinterest empowers users to explore ideas, implement projects, and connect with like-minded individuals, making it a leading platform for personal and professional creative expression, planning, and discovery.",
    "size": 50,
    "reviews": 8,
    "ratingAvg": 4.4,
    "downloads": 15,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 430000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/Cpwtq2cQ/reddit.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "description": "Reddit is a community-driven platform where users can discuss, share, and vote on content across thousands of specialized forums called subreddits. Each subreddit focuses on a specific topic, ranging from hobbies, news, and technology to entertainment, education, and culture. Users can submit text posts, images, videos, links, and polls, fostering engagement and discussion among community members. Upvotes and downvotes determine the visibility of content, promoting popular or relevant posts while filtering out less engaging material. Reddit supports real-time interaction through comments, private messaging, and chat features, allowing users to engage deeply with others who share their interests. Moderation tools empower subreddit administrators to enforce rules, maintain quality, and create safe spaces for discussion. Reddit also hosts AMA (Ask Me Anything) sessions, live events, and community challenges, connecting users with celebrities, experts, and influencers for interactive engagement. The platform emphasizes anonymity, letting users participate with pseudonyms while still building reputation through karma points earned by contributing valuable content. Reddit’s mobile and web accessibility ensures users can stay connected, discover trending topics, and participate in discussions anytime. For brands, creators, and marketers, Reddit provides opportunities to reach targeted communities, share content, and gain insights into audience behavior. With its combination of community, information sharing, entertainment, and engagement, Reddit has become a leading hub for conversations, exploration, and connection. It empowers users to express opinions, seek knowledge, and participate in meaningful discussions, cultivating vibrant, topic-focused communities and shaping online discourse globally.",
    "size": 40,
    "reviews": 10,
    "ratingAvg": 4.2,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 410000 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/ksBN2YyB/Spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "description": "Spotify is a comprehensive music and audio streaming platform that offers users access to millions of songs, podcasts, playlists, and albums across a wide variety of genres and languages. Users can discover new music, follow favorite artists, and create personalized playlists to suit their moods, preferences, and occasions. The platform provides curated playlists, recommendations, and algorithm-driven suggestions based on listening history, ensuring a continuous stream of relevant and engaging content. Spotify supports offline listening, allowing users to download tracks and podcasts for uninterrupted enjoyment anywhere. Podcast creators can share episodes, grow audiences, and monetize content, expanding the platform’s entertainment and educational value. Spotify’s social features let users share music, follow friends, and see their listening activities, fostering engagement and community interaction. The app supports high-quality audio streaming, cross-device access, and seamless synchronization across smartphones, tablets, desktops, and smart speakers. Privacy and account security features allow users to manage personal data, sharing preferences, and subscriptions securely. Spotify Premium offers an ad-free experience, offline downloads, and exclusive content, enhancing the overall user experience. For artists, the platform provides tools and analytics to understand audiences, track performance, and increase visibility, making Spotify a valuable resource for music promotion and career growth. With its diverse catalog, personalized experiences, and intuitive interface, Spotify has transformed the way people consume and engage with music and audio content globally. It empowers users to discover, enjoy, and share music and podcasts while connecting creators and audiences, building a vibrant, interactive, and accessible audio ecosystem for personal enjoyment, entertainment, and creative expression.",
    "size": 60,
    "reviews": 15,
    "ratingAvg": 4.6,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1100000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co.com/B20TgXpv/wes.webp",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "description": "Netflix is a premier streaming service providing a vast library of TV shows, movies, documentaries, and original content to users worldwide. Subscribers can access entertainment across genres, including drama, comedy, action, thriller, sci-fi, and animation, as well as exclusive Netflix Originals produced in-house. The platform allows instant streaming on multiple devices such as smartphones, tablets, smart TVs, and computers, ensuring users can enjoy content anywhere, anytime. Netflix’s algorithm curates personalized recommendations based on viewing history and preferences, enhancing discovery and engagement. Users can create profiles, track favorite shows, and maintain watchlists, making content management seamless. The platform supports features like multiple simultaneous streams, parental controls, subtitles, and different audio languages, improving accessibility and convenience. Netflix Originals have gained global acclaim, delivering high-quality storytelling, diverse representation, and innovative production values. The service provides offline downloads, allowing uninterrupted viewing without internet connectivity. Netflix continuously updates its library with new content, keeping users engaged with trending releases, seasonal specials, and critically acclaimed productions. The platform emphasizes user experience, intuitive navigation, and high-definition streaming quality. For creators and filmmakers, Netflix provides a platform to showcase projects to a global audience, redefine storytelling, and explore creative innovation. With billions of hours streamed annually, Netflix has transformed the entertainment landscape, offering users personalized, diverse, and immersive viewing experiences. It empowers global audiences to explore new stories, cultures, and ideas, shaping digital media consumption while becoming a central hub for entertainment, engagement, and shared cultural experiences.",
    "size": 70,
    "reviews": 25,
    "ratingAvg": 4.5,
    "downloads": 40,
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/qYbHh5bp/amazon2.jpg",
    "title": "Amazon",
    "companyName": "Amazon.com, Inc.",
    "description": "Amazon is a global e-commerce and technology company providing a vast marketplace for millions of products, including electronics, clothing, books, home goods, and more. Users can search, compare, and purchase items conveniently from any device, benefiting from fast and reliable delivery services, including same-day and next-day options in select locations. The platform integrates customer reviews, ratings, and Q&A sections, enabling informed purchase decisions. Amazon also offers personalized recommendations based on browsing history, preferences, and purchase patterns, enhancing user experience and discovery. Amazon Prime members enjoy exclusive benefits such as free shipping, access to Prime Video streaming, Prime Music, and early access to deals, creating a comprehensive ecosystem of services. Sellers and businesses can leverage Amazon Marketplace to reach global audiences, manage inventory, optimize listings, and participate in promotional campaigns, increasing sales opportunities. Amazon’s logistics and fulfillment network ensures timely delivery and order tracking, while secure payment gateways protect user transactions. The platform continually introduces innovative technologies, including AI-driven recommendations, voice shopping with Alexa, and smart home integration, improving convenience and accessibility. Amazon also emphasizes sustainability, ethical sourcing, and community initiatives, reflecting corporate responsibility. With a combination of convenience, variety, and technology-driven solutions, Amazon has revolutionized online shopping, connecting buyers and sellers globally. It empowers consumers to shop efficiently, discover products, and enjoy a seamless digital commerce experience, while providing businesses with tools to grow and compete in the evolving marketplace. Amazon remains a cornerstone of e-commerce innovation and global retail transformation.",
    "size": 80,
    "reviews": 30,
    "ratingAvg": 4.4,
    "downloads": 65,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 1700000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/ympTrXgW/gmail-logo.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Gmail is a fast, secure, and user-friendly email service from Google, providing individuals and businesses with reliable communication tools. Users can send, receive, organize, and manage emails efficiently using features such as labels, filters, search, and priority inbox, ensuring important messages are never missed. Gmail integrates seamlessly with Google Workspace applications like Calendar, Drive, Docs, Sheets, and Meet, enhancing productivity and collaboration. The platform supports attachments of various formats, including documents, images, and videos, with advanced spam detection and phishing protection to ensure security. Gmail offers real-time notifications, offline access, and mobile apps for on-the-go communication. Users can customize their interface with themes, signatures, and shortcuts for an optimized experience. Gmail’s smart compose and reply suggestions utilize AI to improve efficiency and reduce response time. Multiple account support allows easy management of personal and professional emails simultaneously. Security features such as two-factor authentication, encryption, and account recovery options protect user data and privacy. Gmail also supports integration with third-party applications to extend functionality, manage workflows, and enhance productivity. With billions of users globally, Gmail has become an essential tool for personal and professional communication. It empowers users to communicate efficiently, manage information effectively, and collaborate seamlessly. Gmail’s reliability, security, and feature-rich interface make it a leading email platform, facilitating smooth communication, professional correspondence, and digital organization across devices and locations worldwide.",
    "size": 40,
    "reviews": 30,
    "ratingAvg": 4.6,
    "downloads": 70,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/fzv1pN1F/Google-Maps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps is a comprehensive mapping and navigation platform that provides users with accurate, real-time geographical information and directions for driving, walking, cycling, and public transit. Users can explore detailed maps, satellite imagery, street views, and 3D representations to navigate cities, towns, and rural areas worldwide. Google Maps integrates live traffic data, road closures, and route optimization to ensure efficient travel planning and minimize delays. The platform enables users to search for specific addresses, businesses, landmarks, and points of interest while providing reviews, photos, and contact details for better decision-making. With features like personalized location history, saved places, and custom maps, users can plan trips, share itineraries, and discover new destinations easily. Public transport schedules, ride-sharing options, and real-time transit updates enhance commuting convenience. Businesses can leverage Google Maps to improve visibility, attract customers, and provide accurate location details. Street View allows immersive exploration of streets and neighborhoods, helping users visualize destinations before visiting. Google Maps supports offline maps, voice-guided navigation, and real-time location sharing, improving accessibility and safety. The platform continually updates and refines map data using satellite imagery, user contributions, and AI-driven analytics. With seamless integration across devices and Google services, Google Maps empowers individuals, travelers, and organizations to navigate, explore, and connect efficiently. Its focus on accuracy, interactivity, and usability has made it a leading global mapping solution, transforming how people explore, plan, and experience the world with confidence and convenience, while enhancing accessibility to information, transportation, and local businesses for millions of users globally.",
    "size": 50,
    "reviews": 25,
    "ratingAvg": 4.7,
    "downloads": 80,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co.com/3mtB1F9P/imagesd.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "description": "Zoom is a leading video conferencing and online meeting platform that allows individuals, businesses, and organizations to connect virtually with high-quality video, audio, and screen-sharing capabilities. Zoom enables participants to host and join meetings from anywhere using desktop, mobile, and web applications, making collaboration seamless and accessible across different devices. Users can schedule, invite, and manage meetings with customizable settings, including waiting rooms, password protection, and participant controls, ensuring security and smooth communication. The platform supports video webinars, virtual events, and live streaming, offering interactive features such as polls, Q&A sessions, and breakout rooms for focused discussions. Zoom’s chat functionality allows instant messaging, file sharing, and persistent conversations before, during, and after meetings. Recording and transcription features provide documentation and accessibility for participants. Integration with calendar services, productivity tools, and third-party applications enhances workflow and scheduling efficiency. Zoom’s interface is user-friendly, supporting real-time collaboration with co-annotation, whiteboards, and collaborative screen sharing. With scalable infrastructure, Zoom accommodates small team meetings to large enterprise conferences, ensuring reliable performance and minimal latency. The platform emphasizes privacy, encryption, and compliance with global security standards, protecting sensitive data. Zoom’s flexibility, convenience, and comprehensive feature set have transformed remote work, education, and online communication, enabling seamless collaboration, learning, and interaction. It empowers professionals, educators, and teams worldwide to communicate effectively, host engaging events, and maintain productivity in a digital-first environment, making it a cornerstone solution for virtual connectivity, collaboration, and interactive engagement.",
    "size": 60,
    "reviews": 15,
    "ratingAvg": 4.5,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co.com/KjnBTbsp/microsoft.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft",
    "description": "Microsoft Teams is a collaborative platform designed to integrate communication, teamwork, and productivity tools within a unified environment. It allows teams and organizations to chat, call, meet, and collaborate in real time from any device. Users can create channels for different projects or topics, enabling focused discussions and content organization. Teams support instant messaging, audio and video calls, file sharing, and co-authoring of documents through seamless integration with Microsoft 365 applications like Word, Excel, PowerPoint, and OneDrive. Meeting features include scheduling, calendar integration, screen sharing, breakout rooms, recording, and transcription, facilitating efficient collaboration and knowledge sharing. Microsoft Teams also offers task management, planner integration, and third-party app support, streamlining workflows and project coordination. Notifications, search, and tagging features enhance user engagement and information retrieval, while compliance, security, and access controls ensure data protection across teams. Organizations can host webinars, live events, and interactive sessions, extending collaboration to external participants. Teams’ interface is intuitive, promoting productivity, remote work, and hybrid collaboration. Its cross-platform availability ensures consistent access across desktop, mobile, and web applications. Microsoft Teams empowers employees, educators, and professionals to communicate efficiently, manage projects effectively, and maintain connectedness in modern work environments. By combining communication, collaboration, and productivity tools in one platform, Microsoft Teams has become a cornerstone solution for enterprise and organizational communication, fostering engagement, workflow optimization, and teamwork, making it an essential tool for digital collaboration, knowledge sharing, and organizational efficiency globally.",
    "size": 70,
    "reviews": 12,
    "ratingAvg": 4.3,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 650000 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co.com/pr0YPQ9S/ubar2.png",
    "title": "Uber",
    "companyName": "Uber Technologies",
    "description": "Uber is a global ride-hailing and transportation platform that connects riders with drivers through a convenient mobile application, enabling fast, reliable, and safe transportation services. Users can request rides for various vehicle types, including standard, premium, shared, or specialized options, depending on their preferences and budget. The Uber app provides real-time tracking, estimated arrival times, fare calculation, and driver details, ensuring transparency and convenience. In addition to rides, Uber offers services like Uber Eats for food delivery and package transportation in select regions, expanding its utility beyond personal mobility. Users can rate drivers and trips, provide feedback, and access support to maintain service quality and safety. The platform uses GPS navigation and optimized routing to reduce travel time and improve efficiency, while surge pricing adapts dynamically to demand. Payment options include in-app digital wallets, credit/debit cards, and cash in some regions, simplifying transactions. Uber emphasizes safety with features like emergency assistance, trip sharing, driver background checks, and real-time monitoring. The platform continually innovates with autonomous vehicle research, sustainable mobility solutions, and partnerships with local transportation systems. Uber empowers users with on-demand transportation, enhancing urban mobility, convenience, and access to essential services. Its seamless integration of technology, logistics, and user experience has transformed personal travel, delivery services, and urban transport, providing millions of people worldwide with flexible, efficient, and safe mobility solutions for daily commuting, leisure, and business needs.",
    "size": 60,
    "reviews": 14,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/V0S7Gymb/massenger.png",
    "title": "Messenger",
    "companyName": "Meta Platforms",
    "description": "Messenger is a versatile instant messaging platform developed by Meta Platforms that enables users to communicate in real time through text messages, voice calls, video calls, and multimedia sharing. The application integrates seamlessly with Facebook, allowing users to connect with friends, family, and contacts while maintaining conversation histories and shared media. Messenger supports group chats, interactive stickers, GIFs, and emojis, enhancing user engagement and expression in conversations. Users can share photos, videos, documents, locations, and audio messages instantly, making communication dynamic and convenient. The platform provides high-quality voice and video calling features with end-to-end encryption, ensuring privacy and secure communication. Messenger also offers cross-device synchronization, enabling users to access messages on smartphones, tablets, and desktops. Business pages and customer service tools allow brands to interact with clients, send notifications, and provide support efficiently. Chatbots, automated responses, and integration with other Meta services enhance usability for both personal and professional purposes. Privacy settings, message controls, and blocking options empower users to manage interactions safely. Messenger continues to innovate with features like watch together, app extensions, and interactive games, promoting social engagement and entertainment. Its focus on accessibility, real-time communication, and multimedia capabilities has made it an essential tool for personal connection, social interaction, and digital communication. Messenger empowers users to stay connected, share experiences, and communicate effectively, bridging distances and facilitating global engagement in a secure, convenient, and interactive environment.",
    "size": 50,
    "reviews": 20,
    "ratingAvg": 4.3,
    "downloads": 70,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1250000 }
    ]
  }
]
